Public Attributes | List of all members
API_PrimHotspot Struct Reference
Geometry | Library Part Management
A primitive hotspot. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Prim_Head  | head
General primitive element header (not used with ACAPI_LibraryPart_GetHotspots).
 API_Coord  | loc
Coordinate of the hotspot.
 API_Neig  | neig
Neig index and unique ID of the hotspot.
Detailed Description
A primitive hotspot.